const questions = [
  {
    "id": 208,
    "points": 2,
    "type": "single",
    "text": "Међу понуђеним ентитетима, одредити ентитет са атрибутима који НИСУ одговарајући. Заокружити број испред траженог одговора:",
    "options": [
      "Ентитет: СТУДЕНТ – Атрибути: име, презиме, смер, број бодова, просек",
      "Ентитет: ДРЖАВА – Атрибути: назив, број становника, површина",
      "Ентитет: КЊИГА – Атрибути: наслов, аутор, година издања, издавач, адреса издавача, телефон издавача",
      "Ентитет: АВИОН – Атрибути: произвођач, марка, година производње, број седишта"
    ],
    "correct": [
      2
    ],
    "explain": {
      "correct": "Tačno: Ентитет: КЊИГА – Атрибути: наслов, аутор, година издања, издавач, адреса издавача, телефон издавача",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 209,
    "points": 2,
    "type": "single",
    "text": "Заокружите тачан исказ:",
    "options": [
      "Примарни кључ је атрибут који мора бити целобројног типа.",
      "Примарни кључ је атрибут који указује на зависност од неке друге табеле.",
      "Примарни кључ је атрибут који јединствено идетификује врсте утабели.",
      "Ако табела садржи вишевредносни атрибут, њему се додељује функција примарног кључа."
    ],
    "correct": [
      2
    ],
    "explain": {
      "correct": "Tačno: Примарни кључ је атрибут који јединствено идетификује врсте утабели.",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 210,
    "points": 2,
    "type": "single",
    "text": "Заокружити број испред траженог одговора. Одредити оператор који би требало користити у WHERE клаузули SELECT наредбе да би били приказани само они ученици чије презиме почиње словом А:",
    "options": [
      "IN",
      "LIKE",
      "BETWEEN",
      "IS LIKE",
      "BEGINS WITH"
    ],
    "correct": [
      1
    ],
    "explain": {
      "correct": "Tačno: LIKE",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 211,
    "points": 2,
    "type": "single",
    "text": "Заокружити број испред траженог одговора. Табела UCENICI поред осталих података, садржи ивредност стипендије. Одредити оператор који треба употребити у WHERE клаузули SELECT наредбе да би били приказани сви ученици код којих није позната иније унета вредност уколону stipendija: ",
    "options": [
      "=NULL",
      "ISNULL",
      "==NULL 1",
      "IS NULL",
      "LIKE NULL"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: IS NULL",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 212,
    "points": 2,
    "type": "single",
    "text": "Дат је упит: SELECT * FROM ucenici WHERE odeljenje=4 OR odeljenje=7 OR odeljenje=10 Заокружити оператор који треба користити у датом упиту да би се избегло вишеструко коришћење оператора ОR:",
    "options": [
      "LIKE",
      "BETWEEN",
      "AND",
      "IN"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: IN",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 213,
    "points": 2,
    "type": "single",
    "text": "Заокруживањем редног броја обележити клаузулу коју је потребно користи уколико листа иза резервисане речи SELECT садржи агрегатну функцију иједну или више колона које нису део агрегатне функције:",
    "options": [
      "HAVING клаузулу",
      "GROUP BY клаузулу",
      "JOIN клаузулу",
      "ORDER BY клаузулу"
    ],
    "correct": [
      1
    ],
    "explain": {
      "correct": "Tačno: GROUP BY клаузулу",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 214,
    "points": 2,
    "type": "single",
    "text": "Заокружити тачан исказ:",
    "options": [
      "Кардиналност неке везе представља однос броја објеката који се повезују.",
      "Кардиналност неке везе представља апстракцију укојој се скуп сличних типова објеката представља општим генеричким типом (надтипом).",
      "Кардиналност неке везе одређује опционалност учешћа увези.",
      "Кардиналност показује колико кандидата за примарни кључ има неки тип ентитета."
    ],
    "correct": [
      0
    ],
    "explain": {
      "correct": "Tačno: Кардиналност неке везе представља однос броја објеката који се повезују.",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 215,
    "points": 2,
    "type": "single",
    "text": "Дата је табела PROJEKAT над којом се извршава упит: ALTER TABLE PROJEKAT ADD RokKraj date Одредити шта ће се десити након извршења упита. Заокружити број испред траженог одговора. ",
    "options": [
      "утабелу PROJEKAT додаје се ограничење RokKraj",
      "утабелу PROJEKAT додаје се колона RokKraj",
      "утабели PROJEKAT биће преименована колона",
      "убазу података додаје се табела PROJEKAT са само једном колоном",
      "утабели PROJEKAT промениће се тип података уколони RokKraj"
    ],
    "correct": [
      1
    ],
    "explain": {
      "correct": "Tačno: утабелу PROJEKAT додаје се колона RokKraj",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 216,
    "points": 2,
    "type": "single",
    "text": "Дата је табела RADNIK иупит: IDBR IME PREZIME PLATA PREMIJA DATZAP 6234 Marko Pavlović 1300 3000 1990-12-17 6789 Janko Nikolić 3900 10 1999-12-23 SELECT Ime, Prezime, DATEDIFF(year, DatZap, GETDATE()) AS God FROM Radnik Одредити шта је резултат упита. Заокружити број испред траженог одговора:",
    "options": [
      "Табела са подацима оименима ипрезименима радника",
      "Табела са подацима оименима, презименима иброју година које су протекле од датума запослења радника до краја века",
      "Табела са подацима оименима, презименима идатумима запослења радника",
      "Табела са подацима оименима, презименима иброју година које су протекле од датума запослења радника до тренутног датума"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: Табела са подацима оименима, презименима иброју година које су протекле од датума запослења радника до тренутног датума",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 217,
    "points": 2,
    "type": "single",
    "text": "Дата је табела RADNIK, табела ODELJENJE иупит: IDBR IME PREZIME PLATA BROD BROD IMEOD MESTO Sloboda 50 Skladišta Zemun 5900 Golubović 900 10 n 30 Marketing Vračar 5932 Mitar Gavrilović 600 10 10 Plasman Surčin Kosanovi 5953 Persida 1100 20 20 Direkcija Grocka ć 40 Nabavka Barajevo 6234 Marko Pavlović 1300 30 6789 Janko Nikolić 800 10 SELECT Imeod, AVG(Plata) AS ProsekPlata FROM Radnik, Odeljenje WHERE Odeljenje.Brod=Radnik.Brod GROUP BY Imeod HAVING AVG(Plata)>1000 Одредити резултат извршавања датог упита. Заокружити број испред траженог одговора: Завод за унапређивање образовања иваспитања 89 Центар за стручно образовање иобразовање одраслих",
    "options": [
      "Упит се не извршава зато што груписање мора да се изврши не само по називу одељења, него ипо шифри одељења (BrOd)",
      "Групишу по одељењима радници са платом већом од просечне плате",
      "Приказују називи одељења ивисина просечне плате уњима само за одељења укојима је просечна плата већа од 1000",
      "Приказују називи одељења ивисина просечне плате уњима, при чему се код одређивања просека узимају уобзир само плате веће од 1000"
    ],
    "correct": [
      2
    ],
    "explain": {
      "correct": "Tačno: Приказују називи одељења ивисина просечне плате уњима само за одељења укојима је просечна плата већа од 1000",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 218,
    "points": 2,
    "type": "single",
    "text": "Дата је табела RADNIK, табела ODELJENJE иупит: IDBR IME PREZIME PLATA BROD BROD IMEOD MESTO 5900 Slobodan Golubović 900 10 50 Skladišta Zemun 5932 Mitar Gavrilović 600 30 Marketing Vračar 6234 Marko Pavlović 1300 30 10 Plasman Surčin 6789 Janko Nikolić 800 10 20 Direkcija Grocka SELECT Odeljenje.Imeod, Radnik.Ime+' '+ Radnik.Prezme as PunoIme FROM Odeljenje LEFT JOIN Radnik ON Radnik.Brod = Odeljenje.Brod Одредити шта се види као резултат датог упита. Заокружити број испред траженог одговора:",
    "options": [
      "Називи свих одељења – ионих укојима има радника ионих где нико није распоређен - са бројем радника усваком одељењу",
      "За сваког распоређеног радника приказује се по један ред са називом одељења ипуним именом радника, док се за раднике који нису распоређени приказује само пуно име радника",
      "Приказује се по један ред за сваког распоређеног радника са називом одељења ипуним именом радника. За раднике који нису распоређени, као иза одељења укоја нико није распоређен, не формирају се редови урезултујућој табели",
      "За свако одељење се приказује онолико редова колико радника ради утом одељењу, док се за одељења укојима нико не ради приказује по један ред са називом одељења"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: За свако одељење се приказује онолико редова колико радника ради утом одељењу, док се за одељења укојима нико не ради приказује по један ред са називом одељења",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 219,
    "points": 2,
    "type": "single",
    "text": "Дата је табела RADNIK, табела ODELJENJE иупит: IDBR IME PREZIME PLATA BROD BROD IMEOD MESTO 5900 Slobodan Golubović 900 10 50 Skladišta Zemun 5932 Mitar Gavrilović 600 10 30 Marketing Vračar 5953 Persida Kosanović 1100 20 10 Plasman Surčin 6234 Marko Pavlović 1300 30 20 Direkcija Grocka 6789 Janko Nikolić 800 10 40 Nabavka Barajevo SELECT Odeljenje.Brod, Odeljenje.Imeod, COUNT(*) FROM Radnik INNER JOIN Odeljenje ON Radnik.Brod = Odeljenje.Brod GROUP BY Odeljenje.Brod, Odeljenje.Imeod Одредити приказ који је резултат датог упита. Заокружити број испред траженог одговора: Завод за унапређивање образовања иваспитања 90 Центар за стручно образовање иобразовање одраслих",
    "options": [
      "Бројева иназива свих одељења",
      "Бројева иназива свих одељења са бројем радника уњима",
      "Бројева иназива одељења укојима има радника са бројем радника уњима",
      "Бројева иназива одељења укојима нема радника"
    ],
    "correct": [
      2
    ],
    "explain": {
      "correct": "Tačno: Бројева иназива одељења укојима има радника са бројем радника уњима",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 220,
    "points": 2,
    "type": "single",
    "text": "Извршава се следећа SELECT наредба: SELECT MIN(Datum_Zaposlenja), Odsek_Id FROM Zaposleni GROUP BY Odsek_Id Заокруживањем броја испред одговарајућег исказа, одредити које ће вредности бити приказане:",
    "options": [
      "Најранији датум запослења за сваки одсек предузећа.",
      "Најранији датум запослења уцелом предузећу.",
      "Датум запослења последњег запосленог радника уцелом предузећу.",
      "Датум запослења последњег запосленог радника за сваки одсек.",
      "Датум запослења најстаријег запосленог радника усваком одсеку предузећа."
    ],
    "correct": [
      0
    ],
    "explain": {
      "correct": "Tačno: Најранији датум запослења за сваки одсек предузећа.",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 221,
    "points": 2,
    "type": "single",
    "text": "Потребно је креирати извештај који приказује имена свих производа чија је цена већа од просечне цене свих производа. Заокружити број испред упита који одговара постављеном задатку:",
    "options": [
      "SELECT naziv FROM proizvod WHERE cena > (SELECT AVG(cena) FROM proizvod)",
      "SELECT naziv FROM proizvod WHERE cena > AVG(cena)",
      "SELECT naziv FROM proizvod GROUP BY naziv HAVING cena > AVG(cena)",
      "SELECT naziv FROM (SELECT AVG(cena) FROM proizvod) WHERE cena > AVG(cena)"
    ],
    "correct": [
      0
    ],
    "explain": {
      "correct": "Tačno: SELECT naziv FROM proizvod WHERE cena > (SELECT AVG(cena) FROM proizvod)",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 222,
    "points": 2,
    "type": "single",
    "text": "Извршава се упит: SELECT prezime, ime, email FROM ucenik ORDER BY prezime WHERE prosek>=4.50 Наредба се неће извршити. Заокружити број испред разлога услед кога се наредба неће изврити: ",
    "options": [
      "Наредба се неће извршити једино ако нема ни једног одличног ученика.",
      "Услов треба написати у HAVING клаузули",
      "Потребно је назначити редослед сортирања (asc, desc).",
      "Потребно је променити редослед клаузула."
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: Потребно је променити редослед клаузула.",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 223,
    "points": 2,
    "type": "single",
    "text": "Табела ARTIKLI садржи следеће колоне: artikl_id, naziv, kategorija, cena, kolicina. Потребно је да се прикаже категорија и минимална цена артикла у свакој категорији. При томе се тражи приказ само оних категорија где је најмања цена производа већа од задате граничне вредности која се преноси упиту кроз параметар @granica Изабрати упит који даје тражени извештај:",
    "options": [
      "SELECT kategorija, MIN(cena) FROM artikli WHERE MIN(cena)>@granica GROUP BY cena",
      "SELECT kategorija, MIN(cena) FROM artikli 2 GROUP BY kategorija HAVING MIN(cena)>@granica",
      "SELECT kategorija, MIN(cena) FROM artikli GROUP BY MIN(cena), kategorija HAVING MIN(cena)>@granica",
      "SELECT kategorija, MIN(cena) FROM artikli WHERE MIN(cena)>@granica GROUP BY kategorija"
    ],
    "correct": [
      1
    ],
    "explain": {
      "correct": "Tačno: SELECT kategorija, MIN(cena) FROM artikli 2 GROUP BY kategorija HAVING MIN(cena)>@granica",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 224,
    "points": 2,
    "type": "single",
    "text": "Табела RADIONICA садржи следеће колоне: radionica_id, naziv, zanat, lokacija_id. Потребно је да се прикаже колико на свакој локацији има различитих заната. Заокружити број испред упита који даје тражени извештај:",
    "options": [
      "SELECT DISTINCT location_id, COUNT(zanat) FROM radionicа GROUP BY lokacija_id",
      "SELECT location_id, COUNT(zanat) FROM radionicа GROUP BY lokacija_id",
      "SELECT location_id, COUNT(DISTINCT zanat) FROM radionicа GROUP BY lokacija_id",
      "SELECT location_id, COUNT(DISTINCT zanat) FROM radionicа GROUP BY zanat"
    ],
    "correct": [
      2
    ],
    "explain": {
      "correct": "Tačno: SELECT location_id, COUNT(DISTINCT zanat) FROM radionicа GROUP BY lokacija_id",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 225,
    "points": 2,
    "type": "single",
    "text": "Заокружити број испред одговора који представља наставак датог исказа: Уколико поглед (view) треба користити за измену података у табели, поглед НЕ СМЕ садржати... ",
    "options": [
      "WHERE клаузулу",
      "Спој више табела",
      "Алијас колоне",
      "GROUP BY клаузулу"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: GROUP BY клаузулу",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 226,
    "points": 2,
    "type": "single",
    "text": "Дат је упит за креирање погледа и наведени искази који се односе на дати упит. Заокружити број испред тачног исказа: CREATE VIEW Pregled_Proseka AS SELECT UcenikID, Ime, Prezime, AVG(Ocena) AS Prosek FROM Testovi WHERE OdeljenjeID IN (1, 2, 3, 4) GROUP BY UcenikID, Ime, Prezime Pregled_Proseka Уследећим задацима заокружите бројеве испред тражених одговора",
    "options": [
      "Подаци утабели Testovi се могу модификовати коришћењем погледа",
      "Коришћењем датог погледа, подаци се могу само удодавати утабелу Testovi, али не имењати",
      "Овако дат упит изазива грешку при извршењу",
      "Коришћењем датог погледа, подаци из табеле Testovi се могу само прегледавати, али не идодавати или мењати"
    ],
    "correct": [
      3
    ],
    "explain": {
      "correct": "Tačno: Коришћењем датог погледа, подаци из табеле Testovi се могу само прегледавати, али не идодавати или мењати",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 227,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред тражених одговора. Међу понуђеним алатима, обележити Case алате:",
    "options": [
      "Rational Rose",
      "Oracle Designer",
      ".NET",
      "Microsoft Visio",
      "Java",
      "SQL Express"
    ],
    "correct": [
      0,
      1,
      3
    ],
    "explain": {
      "correct": "Tačno: Rational Rose | Oracle Designer | Microsoft Visio",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 228,
    "points": 2,
    "type": "multi",
    "text": "Обележити команде које се сматрају командама ажурирања података у бази података. Заокружити бројеве испред тражених одговора:",
    "options": [
      "Организовање податка",
      "Додавање нових података",
      "Брисање старих података",
      "Враћање оштећених података укоректно стање",
      "Измена постојећих података",
      "Додела права приступа подацима",
      "Измена структуре постојећих табела убази"
    ],
    "correct": [
      1,
      2,
      4
    ],
    "explain": {
      "correct": "Tačno: Додавање нових података | Брисање старих података | Измена постојећих података",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 229,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред тражених одговора. За упите са специфицираним редоследом приказа врста у резултујућој табели користи се клаузула ORDER BY после које се наводи назив колоне: ",
    "options": [
      "ислужбена реч ASC за растући редослед",
      "ислужбена реч DESC за опадајући редослед",
      "ислужбена реч ASC за опадајући редослед",
      "ислужбена реч DESC за растући редослед",
      "службена реч се може изоставити при чему се добија растући поредак",
      "службена реч се може изоставити при чему се добија опадајући поредак"
    ],
    "correct": [
      0,
      1,
      4
    ],
    "explain": {
      "correct": "Tačno: ислужбена реч ASC за растући редослед | ислужбена реч DESC за опадајући редослед | службена реч се може изоставити при чему се добија растући поредак",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 230,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред наредби које служе за креирање, брисање и измену структуре релационе базе и објеката који чине релациону базу:",
    "options": [
      "ALTER TABLE",
      "INSERT",
      "CREATE TABLE",
      "DROP TABLE",
      "UPDATE",
      "DELETE TABLE",
      "ADD COLUMN",
      "ADD CONSTRAINT"
    ],
    "correct": [
      0,
      2,
      3,
      7
    ],
    "explain": {
      "correct": "Tačno: ALTER TABLE | CREATE TABLE | DROP TABLE | ADD CONSTRAINT",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 231,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред тражених одговора. Одредити ентитете који садрже одговарајуће атрибуте:",
    "options": [
      "Ентитет: КЊИГА – Атрибути: наслов, аутор, издавач, година издања",
      "Ентитет: АУТОМОБИЛ – Атрибути: марка, година производње, боја, власник, година рођења власника, регистарски број 2",
      "Ентитет: УЧЕНИК – Атрибути: име, презиме, разред, одељење, број оправданих, број неоправданих, просек",
      "Ентитет: ДРЖАВА – Атрибути: назив, број становника, површина, главни град, број становника главног града, име градоначелника главног града"
    ],
    "correct": [
      0,
      2
    ],
    "explain": {
      "correct": "Tačno: Ентитет: КЊИГА – Атрибути: наслов, аутор, издавач, година издања | Ентитет: УЧЕНИК – Атрибути: име, презиме, разред, одељење, број оправданих, број неоправданих, просек",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 232,
    "points": 2,
    "type": "multi",
    "text": "Дати су искази који се односе на спољашњи кључ табеле (foreign key constraint). Заокружити бројеве испред тачних исказа:",
    "options": [
      "Вредност упољу спољашњег кључа не сме бити NULL",
      "Вредност спољашњег кључа мора бити јединствена (unique) уколони над којом је постављено ограничење спољашњег кључа",
      "Вредност упољу спољашњег кључа мора бити или NULL или једнака некој од 2 вредности из колоне на коју спољашњи кључ референцира",
      "Више редова утабели може садржати исту вредност упољу спољашњег кључа итиме показивати на исти ред уреференцираној табели",
      "Колона спољашњег кључа не мора садржати исти тип података као колона на коју спољашњи кључ референцира"
    ],
    "correct": [
      2,
      3
    ],
    "explain": {
      "correct": "Tačno: Вредност упољу спољашњег кључа мора бити или NULL или једнака некој од 2 вредности из колоне на коју спољашњи кључ референцира | Више редова утабели може садржати исту вредност упољу спољашњег кључа итиме показивати на исти ред уреференцираној табели",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 233,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред тражених одговора. Означити операторе који се НЕ МОГУ користити за поређење са подупитом који враћа више вредности: ",
    "options": [
      "АLL",
      "ANY",
      "BETWEEN 2",
      "SOME",
      "LIKE",
      "IN"
    ],
    "correct": [
      2,
      4
    ],
    "explain": {
      "correct": "Tačno: BETWEEN 2 | LIKE",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 234,
    "points": 2,
    "type": "single",
    "text": "Дата је табела Кupci са структуром: ( Id int primary key, Prezime varchar(50), Adresa varchar(50), Mesto varchar(20), Telefon varchar(5), Status varchar(8) ) И табела NoviКupci са структуром: ( Id int primary key, Prezime varchar(50), Telefon varchar(20), Status varchar(8) ) Извршава се упит: INSERT INTO NoviKupci SELECT * FROM Kupci WHERE Status <> 'Aktivan' Одредити шта је резултат извршења датог упита. Заокружити број испред траженог одговора: NoviKupci",
    "options": [
      "Како табела NoviKupci има све колоне које постоје и утабели Kupci, упит се извршава без грешке и утабелу NoviKupci се уписују записи из табеле Kupci са статусом који није Aktivan",
      "Упит се не извршава, пријављује грешку јер се број колона утабели Kupci разликује од броја колона утабели NoviKupci",
      "Упит би се извршио без грешке да су у SELECT клаузули подупита, уместо * наведене све колоне табеле Kupci које имају своју одговарајућу колону утабели",
      "Упит јавља грешку због покушаја уписа вредности упоље примарног кључа који је аутоматски, тј креира га сама база"
    ],
    "correct": [
      1
    ],
    "explain": {
      "correct": "Tačno: Упит се не извршава, пријављује грешку јер се број колона утабели Kupci разликује од броја колона утабели NoviKupci",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 235,
    "points": 2,
    "type": "multi",
    "text": "Дата је табела RADNIK, табела ODELJENJE и упит: IDBR IME PREZIME PLATA SIFRAOD SIFRAOD IMEOD MESTO 5900 Slobodan Golubović 900 10 10 Marketing Vračar 5932 Mitar Gavrilović 600 20 Direkcija Grocka 5953 Persida Kosanović 1100 20 30 Nabavka Barajevo Креирана је ускладиштена процедура са параметром @br int = NULL Позивом процедуре извршава се упит: UPDATE Radnik SET Radnik.SifraOD = 30 WHERE Radnik.SifraOD=@br or @br IS NULL Одредити који од понуђених исказа су тачни. Заокружити бројеве испред тражених одговора: ",
    "options": [
      "Сви радници који раде уодељењу са шифром једнакој вредности која је пренета кроз параметар @br, биће прераспоређени уодељење чија је шифра 30",
      "Упит распоређује све нераспоређене раднике уодељење са шифром 30",
      "Уколико се параметру @br не пренесе вредност, радници који су до тог момента били нераспоређени, биће распоређени уодељење са шифром 30",
      "Уколико се параметру @br не пренесе вредност, СВИ радници ће бити прераспоређени уодељење чији је brod 30"
    ],
    "correct": [
      0,
      3
    ],
    "explain": {
      "correct": "Tačno: Сви радници који раде уодељењу са шифром једнакој вредности која је пренета кроз параметар @br, биће прераспоређени уодељење чија је шифра 30 | Уколико се параметру @br не пренесе вредност, СВИ радници ће бити прераспоређени уодељење чији је brod 30",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 236,
    "points": 2,
    "type": "multi",
    "text": "Табела Zaposleni садржи поља: Zaposleni_Id, Ime, Prezime, Plata, Odsek_Id. Дат је упит: SELECT Zaposleni_Id, Ime, Prezime FROM Zaposleni WHERE Plata=(SELECT MAX(Plata) FROM Zaposleni GROUP BY Odsek_Id) Дати су искази који описују ефекат извршења упита. Заокружити бројеве испред ТАЧНИХ исказа:",
    "options": [
      "Упит се не извршава зато што уподупиту није дозвољено коришћење групних функција 2",
      "Упит се извршава без грешке ииз сваког одељења бира иприказује податке ораднику који има највећу плату утом одељењу.",
      "Упит се не извршава јер подупит враћа више од једне врсте, акоришћен је оператор за поређење са једном вредношћу.",
      "Уколико би се изоставила GROUP BY клаузула, упит би се извршавао без грешке иприказао би једног или више радника са платом једнакој највећој плати (без обзира на одељење).",
      "Како подупит садржи груписање, да би се цео упит извршио без грешке, потребно је услов са подупитом написати у HAVING уместо у WHERE клаузули"
    ],
    "correct": [
      2,
      3
    ],
    "explain": {
      "correct": "Tačno: Упит се не извршава јер подупит враћа више од једне врсте, акоришћен је оператор за поређење са једном вредношћу. | Уколико би се изоставила GROUP BY клаузула, упит би се извршавао без грешке иприказао би једног или више радника са платом једнакој највећој плати (без обзира на одељење).",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 237,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве под којима су наведене клаузуле SQL наредбе укојима се могу користити аритметичке операције:",
    "options": [
      "SELECT",
      "FROM",
      "WHERE",
      "ORDER BY"
    ],
    "correct": [
      0,
      2,
      3
    ],
    "explain": {
      "correct": "Tačno: SELECT | WHERE | ORDER BY",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 238,
    "points": 2,
    "type": "multi",
    "text": "Извршава се следећи упит: SELECT cena FROM proizvod WHERE cena IN (101,125,150,350) AND (cena BETWEEN 125 AND 140 OR cena >150) Одредити које две вредности може вратити ова наредба. Заокружити бројеве испред тражених вредности:",
    "options": [
      "101",
      "150",
      "125",
      "110",
      "350"
    ],
    "correct": [
      2,
      4
    ],
    "explain": {
      "correct": "Tačno: 125 | 350",
      "wrong": [
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 239,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред команди које се могу користити за ажурирање постојећих података убази: ",
    "options": [
      "DELETE",
      "MERGE",
      "SELECT",
      "UPDATE"
    ],
    "correct": [
      0,
      1,
      3
    ],
    "explain": {
      "correct": "Tačno: DELETE | MERGE | UPDATE",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 240,
    "points": 2,
    "type": "multi",
    "text": "Креиране су табеле SKOLA и OSNOVNASKOLA, а затим су у табелу SKOLA уписани подаци извршавањем следећих наредби: create table Skola( skolaID int primary key, Naziv nvarchar(50), gradID int, tip nvarchar(50) ) create table OsnovnaSkola( gimID int primary key, Naziv nvarchar(50), gradID int ) insert into Skola values (101,'Nikola Tesla',20, 'srednja strucna') insert into Skola values (102,'Dusko Radovic', 20,'osnovna') insert into Skola values (103,'Sveti Sava', 30,'osnovna') insert into Skola values (104,'Bora Stankovic', 20,'gimnazija') Утабелу OSNOVNASKOLA треба уписати податке оосновним школама преписивањем 2 потребних вредности из табеле SKOLA. Заокружити бројеве испред упита који ће јавити грешку при извршењу:",
    "options": [
      "select * into OsnovneSkole from Skola where tip='osnovna'",
      "insert into OsnovneSkole select * from Skola where tip='osnovna'",
      "insert into OsnovneSkole(skolaID, Naziv) select s.skolaID, s.Naziv from Skola as s where tip='osnovna'",
      "insert into OsnovneSkole select s.skolaID, s.Naziv, s.gradID from Skola as s where tip='osnovna'"
    ],
    "correct": [
      1,
      2
    ],
    "explain": {
      "correct": "Tačno: insert into OsnovneSkole select * from Skola where tip='osnovna' | insert into OsnovneSkole(skolaID, Naziv) select s.skolaID, s.Naziv from Skola as s where tip='osnovna'",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 241,
    "points": 2,
    "type": "multi",
    "text": "Креиране су и попуњене подацима табеле Korisnik и Prijatelji. Њихова структура исадржај приказани су на слици: Korisnik Prijatelji ID IME POL Korisnik1 Korisnik2 1 Ana NULL 1 2 2 Steva m 1 3 3 Marta z 2 3 4 Petra z Извршавањем упита добија се табела са подацима. select k.ime, COUNT(*) as [broj prijatelja] from Korisnik as k 2 left join Prijatelji as p on p.korisnik1=k.id or p.korisnik2=k.id where k.pol='z' group by k.id, k.ime Заокруживањем бројева испред понуђених одговора, обележити који од наведених података ће бити приказани упојединим редовима резултујуће табеле: ",
    "options": [
      "Ana, 1 5. Marta, 1",
      "Ana, 2 6. Marta, 2",
      "Steva, 1 7. Petra, 0",
      "Steva, 2 8. Petra, 1"
    ],
    "correct": [
      5,
      7
    ],
    "explain": {
      "correct": "Tačno: ",
      "wrong": [
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 242,
    "points": 2,
    "type": "multi",
    "text": "Заокружити бројеве испред кључних речи које се НЕ КОРИСТЕ за обележавање ограничења (constraints) у језику SQL:",
    "options": [
      "Foreign key",
      "Unique",
      "Distinct",
      "Check",
      "Convert",
      "Union",
      "Not Null",
      "Except"
    ],
    "correct": [
      2,
      4,
      5,
      7
    ],
    "explain": {
      "correct": "Tačno: Distinct | Convert | Union | Except",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 243,
    "points": 2,
    "type": "multi",
    "text": "Одредити ентитете који садрже одговарајуће атрибуте. Заокружити бројеве испред тражених одговора:",
    "options": [
      "Ентитет: СТУДЕНТ – Атрибути: име, презиме, смер, број бодова, просек",
      "Ентитет: КЊИГА – Атрибути: наслов, аутор, година издања, издавач, адреса издавача, телефон издавача",
      "Ентитет: АВИОН – Атрибути: произвођач, марка, година производње, број седишта",
      "Ентитет: ДРЖАВА – Атрибути: назив, број становника, површина",
      "Ентитет: САЈАМ – Атрибути: назив, број излагача, покровитељ, адреса покровитеља, контак особа покровитеља",
      "Ентитет: ТУРИСТИЧКА АГЕНЦИЈА – Атрибути: назив, адреса, година оснивања, власник, стручна квалификација власника, запослени, стручна квалификација запослених"
    ],
    "correct": [
      0,
      2,
      3
    ],
    "explain": {
      "correct": "Tačno: Ентитет: СТУДЕНТ – Атрибути: име, презиме, смер, број бодова, просек | Ентитет: АВИОН – Атрибути: произвођач, марка, година производње, број седишта | Ентитет: ДРЖАВА – Атрибути: назив, број становника, површина",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 244,
    "points": 2,
    "type": "multi",
    "text": "Обележити ентитете код којих је извршен адекватан избор јединственог идентификатора. Заокружи бројеве испред тражених одговора:",
    "options": [
      "јединствени матични број грађанина (ЈМБГ) за ентитет ОСОБА",
      "датум рођења за ентитет ОСОБА",
      "ИСБН број за ентитет КЊИГА",
      "регистарска ознака за АУТОМОБИЛ",
      "дестинација за ентитет АРАНЖМАН",
      "режисер за ентитет ФИЛМ"
    ],
    "correct": [
      0,
      2,
      3
    ],
    "explain": {
      "correct": "Tačno: јединствени матични број грађанина (ЈМБГ) за ентитет ОСОБА | ИСБН број за ентитет КЊИГА | регистарска ознака за АУТОМОБИЛ",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 245,
    "points": 2,
    "type": "multi",
    "text": "Одредити тачан исказ о оператору ANY који се примењује са подупитом који враћа више вредности: TRUE ако све вредности подупита задовољавају услов TRUE ако било која од вредности подупита задовољава услов Завод за унапређивање образовања иваспитања 98 Центар за стручно образовање иобразовање одраслих",
    "options": [
      "Оператор ANY може да се користи испред кључне речи DISTINCT.",
      "Оператор ANY врши поређење са свим вредностима које враћа подупит ивраћа",
      "Оператор ANY врши поређење са свим вредностима које враћа подупит ивраћа",
      "Оператору ANY може да претходи оператор LIKE или оператор IN.",
      "Оператору ANY мора да претходи оператор поређења (=, <>, >, >=, <, <=)",
      "Услов =ANY(скуп вредности) је еквивалентан услову IN (скуп вредности)"
    ],
    "correct": [
      4,
      5
    ],
    "explain": {
      "correct": "Tačno: Оператору ANY мора да претходи оператор поређења (=, <>, >, >=, <, <=) | Услов =ANY(скуп вредности) је еквивалентан услову IN (скуп вредности)",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 246,
    "points": 2,
    "type": "multi",
    "text": "Креирана је табела SKOLA, а затим су у њу уписани подаци извршавањем следећих наредби: create table Skola( skolaID int primary key, Naziv varchar(50) ) insert into Skola values (101,'Nikola Tesla') insert into Skola values (102,'Mihajlo Pupin') insert into Skola values (103,'ETS Zemun') За дати упит, треба проценити сценарио који ће се десити изаокруживањем редних бројева испред исказа, означити могуће исходе: select * into StrucneSkole from Skola StrucneSkole(1) и уњу се преписују сви редови из табеле Skola False Допуните следеће реченице итабеле",
    "options": [
      "Креира се копија табеле Skola - нова табела под именом StrucneSkole исте структуре као итабела Skola и уњу се преписују сви подаци из табеле Skola",
      "Уколико табела са именом StrucneSkole постоји убази, креира се нова са именом",
      "Уколико табела са именом StrucneSkole постоји убази, не креира се нова, само се упостојећу преписују редови из табеле Skola",
      "Уколико табела са именом StrucneSkole постоји убази, упит јавља грешку",
      "Уколико се дода услов where 1=2 упит се извршава, креира се нова табела исте структуре као итабела Skola, али се уњу не уписује ни један ред",
      "Уколико се дода услов where 1=2 упит јавља грешку јер је 1=2 увек нетачно тј.",
      "Упит јавља грешку јер се кључна реч into користи искључиво укомбинацији са insert"
    ],
    "correct": [
      0,
      3,
      4
    ],
    "explain": {
      "correct": "Tačno: Креира се копија табеле Skola - нова табела под именом StrucneSkole исте структуре као итабела Skola и уњу се преписују сви подаци из табеле Skola | Уколико табела са именом StrucneSkole постоји убази, упит јавља грешку | Уколико се дода услов where 1=2 упит се извршава, креира се нова табела исте структуре као итабела Skola, али се уњу не уписује ни један ред",
      "wrong": [
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    }
  },
  {
    "id": 247,
    "points": 2,
    "type": "fill",
    "text": "Допунити реченицу наводећи назив нормалне форме: Уколико ни један атрибут релације није вишевредносни, нити композитни, тј. не може се раставити, кажемо да је релација у _________________________ нормалној форми.",
    "placeholder": "Upiši: 1NF / 2NF / 3NF ...",
    "accept": [
      "prvoj",
      "1",
      "1nf",
      "I",
      "I normalnoj formi",
      "prva normalna forma",
      "1. normalna forma",
      "prva"
    ],
    "explain": {
      "correct": "Tačno: PRVOJ (tj. 1NF)",
      "wrong": []
    }
  },
  {
    "id": 248,
    "points": 2,
    "type": "fill",
    "text": "Допунити реченицу наводећи назив нормалне форме: Уколико сви атрибути релације који нису део кључа зависе од сваког атрибута који је део кључа кажемо да је релација у _____________ нормалној форми.",
    "placeholder": "Upiši: 1NF / 2NF / 3NF ...",
    "accept": [
      "drugoj",
      "2",
      "2nf",
      "II",
      "II normalnoj formi",
      "druga normalna forma",
      "2. normalna forma",
      "druga"
    ],
    "explain": {
      "correct": "Tačno: DRUGOJ (tj. 2NF)",
      "wrong": []
    }
  },
  {
    "id": 249,
    "points": 2,
    "type": "fill",
    "text": "Допунити реченицу наводећи назив нормалне форме: Уколико сви некључни (споредни) атрибути релације не зависе од неког другог некључног атрибута, тј. ако не постоји транзитивна зависност било ког споредног атрибута од било ког кључа те релације, кажемо да је релација у _______________ нормалној форми. ",
    "placeholder": "Upiši: 1NF / 2NF / 3NF ...",
    "accept": [
      "trećoj",
      "trecoj",
      "3",
      "3nf",
      "III",
      "III normalnoj formi",
      "treća normalna forma",
      "3. normalna forma",
      "treca"
    ],
    "explain": {
      "correct": "Tačno: TREĆOJ (tj. 3)",
      "wrong": []
    }
  }
];
